In [11]:
import pandas as pd
import numpy as np
import psycopg2
conn= psycopg2.connect (
    host='34.121.142.1',
    port='5432',
    database= 'db-examen',
    user ='usr-examen',
    password='ECK5kTsNoNmn5tg9FySU')

print("conexion exitosa!")

conexion exitosa!

In [17]:
#1:
sql=""" SELECT * FROM student_csv"""
df_students= pd.read_sql_query(sql,conn)

In [18]:
df_students.head(10)

,Column1,period,period_id,sex,accumulated_average,final_average,status_course,count_credit_course,times,level,graduate,code_student_n,code_course_n
0,57739,2019 - 1,222,M,13.72,10.0,Desaprobado,5.0,1,4,No,244010696,46386
1,22973,2021 - 1,402,M,NaN,NaN,A,4.0,1,9,No,256081479,43307
2,106786,2018 - 2,201,M,11.91,13.0,Aprobado,4.0,2,8,No,280777218,40891
3,80114,2021 - 1,402,M,NaN,NaN,A,2.0,1,3,No,277992473,47329
4,80404,2021-0,401,M,NaN,NaN,A,2.0,1,3,,203613512,47329
5,53009,2016 - 2,24,M,9.75,2.0,Desaprobado,4.0,1,2,No,284683071,54391
6,136199,2012 - 2,6,M,14.14,14.0,Aprobado,3.0,1,2,Si,284933616,42091
7,129963,2021 - 1,402,F,NaN,NaN,A,4.0,1,7,No,205712458,44802
8,106702,2015 - 2,21,F,13.36,14.0,Aprobado,4.0,10,Electivo,Si,232043338,53342
9,127878,2017 - 2,121,M,13.38,8.0,Desaprobado,4.0,1,3,No,210749059,43450

In [19]:
df_students.columns

Index(['Column1', 'period', 'period_id', 'sex', 'accumulated_average',
       'final_average', 'status_course', 'count_credit_course', 'times',
       'level', 'graduate', 'code_student_n', 'code_course_n'],
      dtype='object')

In [20]:
#PREGUNTA 2:
sql=""" SELECT * FROM finance_csv"""
df_finance_csv= pd.read_sql_query(sql,conn)
df_finance_csv.head(10)

,Column1,period,expiration_date,invoice_number,cuota,payment_date,flag_payment,default_days,amount,aid_approved,aid_denied,pct_finance_aid,load_date,recategorization_count,flag_recategorization,flag_finance_aid,code_student_n,id_n
0,30994,2017 - 2,2017-09-09 00:00:00,001-0048620,2.0,2017-09-11 00:00:00,cuota pagada,2.0,2975.00,NaN,NaN,0.00,2021-03-11 17:58:21,NaN,NaN,NaN,240801810,82151
1,14869,2016 - 2,2016-07-31 00:00:00,001-00033355,1.0,2016-08-01 00:00:00,cuota pagada,1.0,1995.00,NaN,NaN,0.00,2021-03-11 17:58:21,NaN,NaN,NaN,241792675,91693
2,63971,2019 - 2,2019-08-04 00:00:00,B001-00040068,1.0,2019-07-22 00:00:00,cuota pagada,-13.0,2724.00,NaN,NaN,0.00,2021-03-11 17:58:21,NaN,NaN,NaN,253533392,95493
3,8413,2016 - 1,2016-03-13 00:00:00,001-00027422,1.0,2016-07-15 00:00:00,cuota pagada,124.0,1411.20,NaN,NaN,0.00,2021-03-11 17:58:21,NaN,NaN,NaN,223432253,95819
4,64312,2019 - 2,2019-08-04 00:00:00,B001-00041109,1.0,2019-08-05 00:00:00,cuota pagada,1.0,2204.00,NaN,NaN,0.00,2021-03-11 17:58:21,NaN,NaN,NaN,211128208,86880
5,89682,2020 - 2,2020-10-21 00:00:00,B001-00077463,2.0,2020-10-28 00:00:00,cuota pagada,7.0,1339.20,NaN,NaN,0.00,2021-03-11 17:58:21,NaN,NaN,NaN,220316191,98623
6,3630,2015 - 1,2015-06-16 00:00:00,001-00020058,4.0,2015-05-27 00:00:00,cuota pagada,-20.0,1710.00,NaN,NaN,0.00,2021-03-11 17:58:21,NaN,NaN,NaN,215394453,92548
7,95833,2020 - 2,2021-05-15 00:00:00,B001-00087134,9.0,,cuota vencida,NaN,1484.24,1.0,0.0,0.15,2021-03-11 17:58:21,0.0,0.0,1.0,202135328,83181
8,87594,2020 - 2,2020-12-15 00:00:00,B001-00081940,4.0,2020-12-28 00:00:00,cuota pagada,13.0,1249.92,NaN,NaN,0.00,2021-03-11 17:58:21,NaN,NaN,NaN,280327822,98315
9,19502,2017 - 1,2017-05-10 00:00:00,001-00041866,3.0,2017-05-19 00:00:00,cuota pagada,9.0,1635.30,NaN,NaN,0.00,2021-03-11 17:58:21,NaN,NaN,NaN,219013004,97307

In [94]:
df_finance_csv["period"].unique() #tenemos solo periodo   1 y 2

array(['2017 - 2', '2016 - 2', '2019 - 2', '2016 - 1', '2020 - 2',
       '2015 - 1', '2017 - 1', '2019 - 1', '2020 - 1', '2018 - 2',
       '2015 - 2', '2018 - 1', '2013 - 1', '2012 - 2', '2014 - 2',
       '2013 - 2', '2012 - 1', '2014 - 1'], dtype=object)

In [21]:
df_finance_csv.columns

Index(['Column1', 'period', 'expiration_date', 'invoice_number', 'cuota',
       'payment_date', 'flag_payment', 'default_days', 'amount',
       'aid_approved', 'aid_denied', 'pct_finance_aid', 'load_date',
       'recategorization_count', 'flag_recategorization', 'flag_finance_aid',
       'code_student_n', 'id_n'],
      dtype='object')

In [82]:
df_finance_csv['pct_finance_aid'].mean()

0.08717039572889922

In [ ]:
2 ¿Calcular lo siguiente por alumno segun datos financieros (solo tener en cuenta periodo 1 y 2)?
	pct_finance_aid media por alumnos
	flag_payment CANTIDAD DE BOLETAS PAGADAS Y NO PAGADAS , Cantidad de registros

In [95]:
df_finance_csv.groupby(["pct_finance_aid","code_student_n"]).mean() #matriculados periodo 1 y 2

                                     Column1     cuota  default_days  \
pct_finance_aid code_student_n
0.00            200021336       49580.500000  3.500000     79.000000
                200092999       34433.714286  2.285714      5.666667
                200191553       29737.000000  3.000000           NaN
                200191626       62611.500000  2.833333     19.000000
                200213607       53592.666667  3.666667     -0.666667
...                                      ...       ...           ...
1.10            232170443        2152.600000       NaN           NaN
1.25            200530544        1030.000000       NaN           NaN
                244050579        8907.500000       NaN           NaN
                261708175        2973.000000       NaN           NaN
1.30            283647754       91632.000000  1.000000           NaN

                                     amount  aid_approved  aid_denied  \
pct_finance_aid code_student_n
0.00            200021336        377.333333           NaN         NaN
                200092999       1692.557143           NaN         NaN
                200191553        817.650000           NaN         NaN
                200191626       1523.333333           NaN         NaN
                200213607       2479.500000           NaN         NaN
...                                     ...           ...         ...
1.10            232170443               NaN           NaN         NaN
1.25            200530544               NaN           NaN         NaN
                244050579               NaN           NaN         NaN
                261708175               NaN           NaN         NaN
1.30            283647754       1601.580000           1.0         0.0

                                recategorization_count  flag_recategorization  \
pct_finance_aid code_student_n
0.00            200021336                          NaN                    NaN
                200092999                          NaN                    NaN
                200191553                          NaN                    NaN
                200191626                          NaN                    NaN
                200213607                          NaN                    NaN
...                                                ...                    ...
1.10            232170443                          NaN                    NaN
1.25            200530544                          NaN                    NaN
                244050579                          NaN                    NaN
                261708175                          NaN                    NaN
1.30            283647754                          1.0                    1.0

                                flag_finance_aid          id_n
pct_finance_aid code_student_n
0.00            200021336                    NaN  91077.166667
                200092999                    NaN  90753.714286
                200191553                    NaN  91674.750000
                200191626                    NaN  92379.166667
                200213607                    NaN  89309.333333
...                                          ...           ...
1.10            232170443                    NaN  80006.000000
1.25            200530544                    NaN  80006.000000
                244050579                    NaN  80006.000000
                261708175                    NaN  80006.000000
1.30            283647754                    1.0  90246.000000

[5093 rows x 10 columns]

In [ ]:
##################

In [30]:
#1:
sql=""" SELECT * FROM background_csv"""
df_background_csv= pd.read_sql_query(sql,conn)
df_background_csv.head(10)

,Column1,period_enrolled,type_course,score_course,admission_process_average,code_student_n
0,8917,2015 - 1,Comunicación,18.0,NaN,295462343
1,31784,2018 - 1,Comunicación,17.0,57.55000,265184353
2,37333,2019 - 1,Comunicación,12.0,52.85000,216359032
3,43710,2020 - 1,"Ciencia, tecnología y Ambiente",14.0,77.78125,209491493
4,17265,2016 - 2,Comunicación,13.0,59.15000,287814725
5,20933,2017 - 1,Comunicación,12.0,55.75000,213118959
6,12214,2016 - 1,Matemáticas,13.0,NaN,256869298
7,16711,2016 - 2,"Ciencia, tecnología y Ambiente",12.0,57.46400,292021610
8,4553,2013 - 1,"Ciencia, tecnología y Ambiente",12.0,NaN,289018750
9,40045,2020 - 1,Comunicación,18.0,47.72500,281813247

In [31]:
df_background_csv.columns

Index(['Column1', 'period_enrolled', 'type_course', 'score_course',
       'admission_process_average', 'code_student_n'],
      dtype='object')

In [32]:
#¿cuantos alumnos se han matriculado y matriculas totales hay?
#completos y unicos 
df_background_csv['code_student_n'].value_counts()

279576656    13
273056464    12
251476782    12
284644431    12
248589967    11
             ..
247782679     1
203710045     1
242765468     1
279740656     1
213769310     1
Name: code_student_n, Length: 4437, dtype: int64

In [33]:
df_background_csv['code_student_n'].isnull()

0        False
1        False
2        False
3        False
4        False
         ...
23380    False
23381    False
23382    False
23383    False
23384    False
Name: code_student_n, Length: 23385, dtype: bool

In [43]:
df_background_csv.head(9)

,Column1,period_enrolled,type_course,score_course,admission_process_average,code_student_n
0,8917,2015 - 1,Comunicación,18.0,NaN,295462343
1,31784,2018 - 1,Comunicación,17.0,57.55000,265184353
2,37333,2019 - 1,Comunicación,12.0,52.85000,216359032
3,43710,2020 - 1,"Ciencia, tecnología y Ambiente",14.0,77.78125,209491493
4,17265,2016 - 2,Comunicación,13.0,59.15000,287814725
5,20933,2017 - 1,Comunicación,12.0,55.75000,213118959
6,12214,2016 - 1,Matemáticas,13.0,NaN,256869298
7,16711,2016 - 2,"Ciencia, tecnología y Ambiente",12.0,57.46400,292021610
8,4553,2013 - 1,"Ciencia, tecnología y Ambiente",12.0,NaN,289018750

In [45]:
df_background_csv.loc[df_background_csv['code_student_n']==289018750]
# period_enrolled y code_student_n

,Column1,period_enrolled,type_course,score_course,admission_process_average,code_student_n
8,4553,2013 - 1,"Ciencia, tecnología y Ambiente",12.0,NaN,289018750
7133,4549,2013 - 1,"Ciencia, tecnología y Ambiente",11.0,NaN,289018750
8984,4554,2013 - 1,Comunicación,12.0,NaN,289018750
12419,4546,2013 - 1,Comunicación,13.0,NaN,289018750
14334,4548,2013 - 1,Comunicación,14.0,NaN,289018750
15810,4550,2013 - 1,Comunicación,11.0,NaN,289018750

In [48]:
df_background_csv['period_enrolled'].value_counts()

2017 - 1    3540
2018 - 1    3001
2020 - 1    2648
2019 - 1    2307
2016 - 1    2255
2015 - 1    1656
2013 - 1    1272
2012 - 1    1242
2014 - 1    1163
2020 - 2    1075
2019 - 2     784
2017 - 2     717
2018 - 2     660
2015 - 2     600
2016 - 2     465
Name: period_enrolled, dtype: int64

In [56]:
periodo_student=df_background_csv[["period_enrolled","code_student_n"]]
periodo_student.head()

  period_enrolled  code_student_n
0        2015 - 1       295462343
1        2018 - 1       265184353
2        2019 - 1       216359032
3        2020 - 1       209491493
4        2016 - 2       287814725

In [64]:
sum_2017_2=periodo_student.loc[periodo_student['period_enrolled']=='2017 - 2'].value_counts().sum()

In [65]:
sum_2017_1=periodo_student.loc[periodo_student['period_enrolled']=='2017 - 1'].value_counts().sum()

In [66]:
print("suma de matriculados: ", sum_2017_1+sum_2017_1)

suma de matriculados:  7080

In [81]:
df_background_csv.groupby(["period_enrolled","code_student_n"]).size().sum() #matriculados periodo 1 y 2

period_enrolled  code_student_n
2012 - 1         200021336         5
                 200530544         9
                 200810069         6
                 201390798         5
                 201440877         5
                                  ..
2020 - 2         299071702         3
                 299205948         6
                 299250221         5
                 299488836         3
                 299530766         5
Length: 4440, dtype: int64

In [ ]:
Pregunta:
1 ¿Cuantos alumnos desertaron y se matricularon por periodo de inicio de periodos regulares (periodo 1 y 2)?


2 ¿Calcular lo siguiente por alumno segun datos financieros (solo tener en cuenta periodo 1 y 2)?
	pct_finance_aid media por alumnos
	flag_payment CANTIDAD DE BOLETAS PAGADAS Y NO PAGADAS , Cantidad de registros
3 ¿cuantos registros de background y estudiante comparten las dos bases (solo tener en cuenta periodo 1 y 2)?
4 Unificar datos del estudiante, finanzas y background e informar el número de alumnos que comparten
datos en todas las fuentes. (solo tener en cuenta periodo 1 y 2)

In [ ]:
background_csv
finance_csv
student_csv

In [102]:
new_tabla= pd.merge(df_background_csv,df_students, on='code_student_n')
new_tabla

,Column1_x,period_enrolled,type_course,score_course,admission_process_average,code_student_n,Column1_y,period,period_id,sex,accumulated_average,final_average,status_course,count_credit_course,times,level,graduate,code_course_n
0,8917,2015 - 1,Comunicación,18.0,NaN,295462343,127880,2017 - 2,121,M,14.38,15.0,Aprobado,4.0,1,3,No,43450
1,8917,2015 - 1,Comunicación,18.0,NaN,295462343,120762,2020 - 1,241,M,14.63,16.0,Aprobado,4.0,1,Electivo,No,43378
2,8917,2015 - 1,Comunicación,18.0,NaN,295462343,135541,2020 - 1,241,M,14.63,17.0,Aprobado,2.0,1,9,No,59168
3,8917,2015 - 1,Comunicación,18.0,NaN,295462343,115808,2016 - 2,24,M,14.01,18.0,Aprobado,3.0,1,2,No,44831
4,8917,2015 - 1,Comunicación,18.0,NaN,295462343,130384,2017 - 1,26,M,14.14,13.0,Aprobado,4.0,1,4,No,44046
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
381858,26077,2017 - 2,Comunicación,14.0,NaN,209990783,26348,2018 - 1,146,M,14.19,12.0,Aprobado,4.0,1,1,No,46930
381859,26077,2017 - 2,Comunicación,14.0,NaN,209990783,108093,2018 - 2,201,M,13.63,13.0,Aprobado,4.0,1,4,No,56103
381860,26077,2017 - 2,Comunicación,14.0,NaN,209990783,19710,2017 - 2,121,M,13.47,13.0,Aprobado,4.0,1,1,No,41782
381861,26077,2017 - 2,Comunicación,14.0,NaN,209990783,32182,2018 - 2,201,M,13.63,NaN,Retirado,4.0,1,2,No,58861
381862,26077,2017 - 2,Comunicación,14.0,NaN,209990783,17560,2018 - 1,146,M,14.19,16.0,Aprobado,4.0,1,2,No,52018

In [ ]:
conn.close()